app/controllers/category_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        @category = Category.all

INSERT INTO "categories" ("name", "feature", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "utensils"], ["feature", "kitchen items"], ["created_at", "2022-12-27 13:14:38.946692"], ["updated_at", "2022-12-27 13:14:38.946692"]]
---
      def create
        @category = Category.new(category_params)
        if @category.save

UPDATE "categories" SET "updated_at" = ? WHERE "categories"."id" = ?  [["updated_at", "2022-12-27 13:22:04.548519"], ["id", 8]]
---
      def update
        unless @category.update(category_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      def find_category
        @category = Category.find_by_id!(params[:id])