app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def find_user
      @user = User.find_by_id!(params[:user_id]) || User.find_by_name!(params[:username])      rescue ActiveRecord::RecordNotFound
---
SELECT "users".* FROM "users" WHERE "users"."name" IS NULL LIMIT ?  [["LIMIT", 1]]